{
  "meta": {
    "title": "Maurice el-Banna //Portfolio",
    "description": "Portfolio von Maurice el-Banna, einem Frontend Entwickler aus Österreich. Schauen sie sich meine Skills und Erfahrungen an, oder treten Sie mit mir in Kontakt!"
  },
  "splash": {
    "scroll_button": "Über Mich",
    "heading_part1": "Servus,",
    "heading_part2": "Ich bin <0>Maurice el-Banna</0>,",
    "heading_part3": "ein Frontend Entwickler",
    "heading_part4": "aus <1>Öst</1>erre<1>ich</1>"
  },
  "skills": {
    "heading": "Meine Skills (via Pluralsight)",
    "frontend_heading": "Frontend",
    "backend_heading": "Backend",
    "database_heading": "Datenbanken"
  },
  "about_me": {
    "heading": "Über Mich",
    "text": "Ich bin ein 24-jähriger Full-Stack-Entwickler, der derzeit in Österreich lebt. Meine Leidenschaft ist es, Erlebnisse für Benutzer zu schaffen, vor allem im Web.<br/><br/>Ich habe bereits sowohl an kleinen privaten Projekten als auch an großen internationalen Langzeitprojekten gearbeitet. Obwohl ich nur 3 Jahre Berufserfahrung habe, programmiere ich schon seit über 10 Jahren.<br/><br/>Wenn Sie mich für ein Projekt engagieren möchten, können Sie mich gerne auf <0>LinkedIn</0> kontaktieren."
  },
  "projects": {
    "heading": "Einige Meiner Projekte",
    "portfolio": {
      "text": "Die Website, die Sie gerade sehen, wurde in React geschrieben, mit dem Ziel, das Framework im Laufe der Zeit zu erlernen. Die Idee dazu kam mir, als ich das Projekt <0>\"k9s\"</0> sah und von der schönen Konsolenanwendung beeindruckt war. Ich habe versucht, ein mehr oder weniger überzeugendes CLI-Feeling zu erzeugen und dabei die modernen Features eines Browsers für Animationen zu nutzen.<br/><br/>Wenn Sie sich für den Code interessieren, schauen Sie hier: <1>github.com</1>"
    },
    "q_help": {
      "text": "Zu Beginn der Corona-Krise dachten ich und 2 Kollegen, dass wir den Menschen in Not irgendwie helfen wollen. Das Problem war, dass die Menschen, die unter Quarantäne standen, keine Möglichkeit hatten, ihre täglichen Bedürfnisse zu erfüllen, wie z.B. einkaufen oder mit dem Hund spazieren gehen. Q-Help hilft Menschen, indem es sie aufgrund ihrer geografischen Nähe zusammenbringt. Das Projekt basiert auf Ionic/Angular und Firebase (Storage, Firestore, Functions, Authentication, ...).<br/><br/>Sie können sich das Projekt hier live ansehen: <0>qhelp.app</0>"
    },
    "gamerpals": {
      "text": "Als begeisterte Gamer haben ich mich mit einem Klassenkameraden zusammengetan, um die ultimative Plattform zur Gruppenfindung zu schaffen. Das Ziel war es, Gruppen auf der Grundlage relevanter Kriterien zusammenzubringen - seien es Gilden oder sogar Matchmaking-Gruppen. Die relevanten Technologien sind Angular/Electron auf dem Frontend und ein Backend bestehend aus einem C# REST Service und einer MongoDB Datenbank, wobei ich hauptsächlich am Frontend gearbeitet habe.<br/><br/>Eine Demo des Projekts können Sie sich hier ansehen: <0>gamerpals-website.herokuapp.com</0><br/>Wenn Sie sich für den Frontend-Code interessieren, schauen Sie hier: <1>github.com</1>"
    },
    "more": {
      "heading": "Mehr",
      "text": "Wenn Sie mehr über mich erfahren möchten oder sich einige meiner Projekte ansehen wollen, empfehle ich Ihnen, die folgenden Links zu besuchen:"
    }
  }
}
