{
  "meta": {
    "title": "Maurice el-Banna //Portfolio",
    "description": "Portfolio of Maurice el-Banna, a frontend developer from Austria. View my Skills and Projects, or get in touch with me!"
  },
  "splash": {
    "scroll_button": "About Me",
    "heading_part1": "Servus,",
    "heading_part2": "I'm <name>Maurice el-Banna</name>,",
    "heading_part3": "a frontend developer",
    "heading_part4": "from <red_part>Au</red_part>str<red_part>ia</red_part>"
  },
  "skills": {
    "heading": "My Skills (by Pluralsight)",
    "frontend_heading": "Frontend",
    "backend_heading": "Backend",
    "database_heading": "Database"
  },
  "about_me": {
    "heading": "About Me",
    "text": "I'm a {{age}} year old frontend developer currently living in Austria. My passion is creating experiences for users, especially on the web.<br/><br/>I've worked on small private projects as well as large long-term international projects. Despite having only 3 years of professional experience, I've been programming for over 10 years now.<br/><br/>If you would like to have me on a project, feel free to contact me on <linkedin_link>LinkedIn</linkedin_link>."
  },
  "projects": {
    "heading": "Some Of My Projects",
    "portfolio": {
      "text": "The website you are currently viewing, was written in React with the goal of learning the framework in the progress. The idea for it came to me when I saw the project <k9s>\"k9s\"</k9s> and was impressed by the beautiful console application. I tried to create a more or less convincing CLI feeling while using the modern features of a browser for animations.<br/><br/>If you are interested in the code, look here: <github>github.com</github>"
    },
    "qhelp": {
      "text": "At the start of the Corona crisis, myself and 2 colleagues thought that we would like to help the people in need somehow. The problem was that people who were in quarantine had no way to meet their daily needs, such as shopping, or walking the dog. Q-Help helps people by bringing them together based on geographical proximity. The project is based on Ionic/Angular and Firebase (Storage, Firestore, Functions, Authentication, ...).<br/><br/>You can view the project live here: <demo>qhelp.app</demo>"
    },
    "dashdot": {
      "text": "Dash. (or Dashdot) is a modern server dashboard, which is primarly used for smaller servers, especially in the home-server area. With over 1000 GitHub Stars, it is one of the most popular of its kind.<br/><br/>- Click here for the live demo: <demo>dash.mauz.io</demo><br/>- And here for the GitHub project: <github>github.com</github>"
    },
    "more": {
      "heading": "More",
      "text": "If you want to learn more about me, or if you want to check out some more of my projects, I encourage you to visit the following links:<br/><br/>- <github>GitHub</github><br/>- <linkedin>LinkedIn</linkedin><br/>- <stackoverflow>StackOverflow</stackoverflow>"
    }
  }
}
